INSERT INTO universities
VALUES
(7, 'جامعة بيت لحم');

INSERT INTO colleges (name, university)
VALUES
('الكل', 7);

INSERT INTO majors (name, college)
VALUES
('العلوم الطبية المخبرية', 39),
('المحاكاة المحوسبة في العلوم والهندسة', 39),
('للغة الانجليزية وآدابها والتواصل', 39),
('التمريض', 39),
('أنظمة المعلومات الحاسوبية', 39),
('الرياضيات', 39),
('الأحياء', 39),
('اللغة العربية وآدابها', 39),
('الفيزياء', 39),
('رياض الأطفال', 39),
('علم اجتماع', 39),
('المرحلة الأساسية العليا – تعليم الرياضيات', 39),
('المرحلة الأساسية العليا – تعليم التاريخ والجغرافيا', 39),
('المرحلة الأساسية العليا – تعليم اللغة الإنجليزية', 39),
('المرحلة الأساسية العليا – تعليم اللغة العربية', 39),
('المرحلة الأساسية الدنيا', 39),
('إدارة الفنادق', 39),
('العلاج الطبيعي', 39),
('العلاج الوظيفي', 39),
('القبالة', 39),
('إدارة الأعمال', 39),
('المحاسبة', 39),
('اللغة الإنجليزية وآدابها', 39),
('الدراسات الدينية', 39),
('الخدمة الاجتماعية', 39),
('الكيمياء', 39),
('هندسة البرمجيات', 39)