INSERT INTO universities
VALUES
(3, 'جامعة بيرزيت');


--

INSERT INTO colleges (name, university)
VALUES
('كلية الآداب', 3),
('كلية الأعمال والاقتصاد', 3),
('كلية الدراسات العليا', 3),
('كلية العلوم', 3),
('كلية الحقوق والإدارة العامة', 3),
('كلية الصيدلة والتمريض والمهن الصحية', 3),
('كلية التربية', 3),
('كلية الهندسة والتكنولوجيا', 3),
('كلية الفنون والموسيقى والتصميم', 3),
('كلية بيرزيت المتوسطة', 3);

--

INSERT INTO majors (name, college)
VALUES
('اللغة العربية وآدابها', 19),
('فرعي اللغة العربية وآدابها', 19),
('ماجستير اللغة العربية وآدابها', 19),
('الدراسات الثقافية', 19),
('فرعي الفلسفة', 19),
('اللغة الانجليزية', 19),
('اللغة الالمانية', 19),
('اللغة العبرية', 19),
('اللغة الايطالية', 19),
('فرعي الترجمة', 19),
('اللغة الإسبانية', 19),
('اللغة التركية', 19),
('اللغة الالمانية', 19),
('فرعي اللغة الألمانية', 19),
('اللغة الصينية', 19),
('الترجمة', 19),
('اللغة الإنجليزية وآدابها', 19),
('فرعي اللغة الإنجليزية وآدابها', 19),
('رئيسي اللغة الانجليزية وآدابها / فرعي الترجمة', 19),
('الجغرافية', 19),
('رئيسي الجغرافية / فرعي التاريخ', 19),
('رئيسي الجغرافية / فرعي العلوم السياسية', 19),
('فرعي الجغرافية', 19),
('رئيسي الجغرافية / فرعي الاقتصاد', 19),
('رئيسي الجغرافية / فرعي علم الاجتماع', 19),
('رئيسي الجغرافية / فرعي العلاقات الدولية', 19),
('جيوانفورماتكس', 19),
('ماجستير الجغرافية', 19),
('رئيسي التاريخ / فرعي الآثار الفلسطينية', 19),
('الآثار الفلسطينية', 19),
('التاريخ', 19),
('رئيسي التاريخ / فرعي العلوم السياسية', 19),
('فرعي التاريخ', 19),
('فرعي الأثار الفلسطينية', 19),
('ماجستير التاريخ العربي الإسلامي', 19),
('رئيسي الاعلام - صحافة / فرعي العلوم السياسية', 19),
('الصحافة', 19),
('الإعلام', 19),
('الإذاعة', 19),
('التلفزة', 19),
('رئيسي الاعلام - صحافة / فرعي علم الاجتماع', 19),
('رئيسي الاعلام - إذاعة / فرعي التلفزة', 19),
('الإعلام', 19),
('الدراسات العربية والفلسطينية', 19),
('دراسات المرأة', 19),
('فرعي دراسات المرأة', 19),
('الفنون الجميلة', 19),
('الفنون الجميلة', 19),
('الفنون الجميلة', 19),
('اللغة الفرنسية', 19),
('فرعي اللغة الفرنسية', 19),
('تعليم اللغة الفرنسية', 19),
('ترجمة فرنسية تحريرية وفورية', 19),
('علم الاجتماع', 19),
('فرعي علم الاجتماع', 19),
('علم الإنسان', 19),
('العمل الإجتماعي', 19),
('رئيسي علم النفس / فرعي علم الاجتماع', 19),
('فرعي علم النفس', 19),
('علم النفس', 19),
('رئيسي علم النفس / فرعي دراسات المرأة', 19),
('رئيسي علم الاجتماع / فرعي علم النفس', 19),
('رئيسي علم الاجتماع / فرعي الادارة العامة', 19),
('ماجستير علم الاجتماع', 19),
('ماجستير علم النفس المجتمعي', 19),
('الاكاديمية الدولية للفنون - فلسطين', 19),
('ماجستير الدراسات العربية المعاصرة', 19),
('ماجستير الترجمة ثلاثي اللغة', 19);

INSERT INTO majors (name, college)
VALUES
('المحاسبة', 20),
('فرعي المحاسبة', 20),
('ماجستير المحاسبة والتدقيق', 20),
('فرعي إدارة الاعمال', 20),
('إدارة الاعمال', 20),
('التسويق', 20),
('فرعي التسويق', 20),
('الإقتصاد', 20),
('فرعي الإقتصاد', 20),
('اقتصاد الأعمال', 20),
('ماجستير الإقتصاد', 20),
('فرعي العلوم المالية والمصرفية', 20),
('العلوم المالية والمصرفية', 20),
('العلوم المالية الاكتوارية', 20),
('التعليم التعاوني', 20),
('ماجستير إدارة الأعمال', 20),
('ماجستير إدارة الأعمال التنفيذي', 20);


INSERT INTO majors (name, college)
VALUES
('دكتوراه العلوم الاجتماعية', 21),
('ماجستير الإحصاء التطبيقي', 21),
('ماجستير هندسة المياه والبيئة', 21),
('ماجستير الصحة العامة والمجتمعية', 21),
('ماجستير الدراسات الدولية', 21),
('ماجستير الديمقراطية وحقوق الإنسان', 21),
('ماجستير علوم المياه والبيئة', 21),
('ماجستير دراسات النوع الاجتماعي والتنمية', 21),
('ماجستير الدراسات الإسرائيلية', 21),
('ماجستير الإحصاء التطبيقي وعلم البيانات', 21),
('ماجستير ماجستير دراسات الهجرة الدولية واللجوء', 21),
('ماجستير إدارة الطاقة المتجددة', 21),
('ماجستير التنمية المجتمعية', 21),
('ماجستير العمل الإنساني في الصراعات الدولية', 21);


INSERT INTO majors (name, college)
VALUES
('الأحياء', 22),
('فرعي الكيمياء الحيوية', 22),
('مساقات العلوم الطبيعية', 22),
('رئيسي الأحياء / فرعي الكيمياء الحيوية', 22),
('رئيسي الأحياء / فرعي إدارة الأعمال', 22),
('رئيسي الأحياء / فرعي التسويق', 22),
('رئيسي الأحياء / فرعي الآثار', 22),
('فرعي الأحياء', 22),
('رئيسي الاحياء / فرعي التغذية والحمية', 22),
('ماجستير الأحياء البيئية', 22),
('مشغل ورشة الزجاج', 22),
('الكيمياء', 22),
('فرعي الكيمياء', 22),
('الكيمياء التطبيقية', 22),
('مساقات العلوم الطبيعية', 22),
('رئيسي الكيمياء / فرعي ادارة الأعمال', 22),
('رئيسي الكيمياء / فرعي التسويق', 22),
('رئيسي الكيمياء / فرعي الكيمياء الحيوية', 22),
('رئيسي الكيمياء / فرعي التغذية والحمية', 22),
('فرعي الكيمياء الصناعية', 22),
('رئيسي الكيمياء/ فرعي الكيمياء الصناعية', 22),
('ماجستير الكيمياء التطبيقية', 22),
('الرياضيات التطبيقية في الإقتصاد', 22),
('الرياضيات', 22),
('فرعي الرياضيات', 22),
('فرعي الاحصاء', 22),
('رئيسي الرياضيات / فرعي الإحصاء', 22),
('رئيسي الرياضيات / فرعي علم الحاسوب', 22),
('رئيسي الرياضيات / فرعي الاقتصاد', 22),
('رئيسي الرياضيات / فرعي العلوم المالية والمصرفية', 22),
('ماجستير الرياضيات', 22),
('الفيزياء', 22),
('رئيسي الفيزياء / فرعي الرياضيات', 22),
('رئيسي الفيزياء / فرعي علم الحاسوب', 22),
('رئيسي الفيزياء / فرعي الالكترونيات', 22),
('فرعي الفيزياء', 22),
('ماجستير الفيزياء', 22);

INSERT INTO majors (name, college)
VALUES
('الإدارة العامة', 23),
('فرعي الادارة العامة', 23),
('رئيسي الإدارة العامة / فرعي الإقتصاد', 23),
('رئيسي الإدارة العامة / فرعي العلوم السياسية', 23),
('فرعي علوم الدولة', 23),
('رئيسي إدارة عامة / فرعي علاقات دولية', 23),
('القانون', 23),
('ماجستير القانون', 23),
('ماجستير القانون العام', 23),
('ماجستير القانون الخاص', 23),
('العلوم السياسية', 23),
('رئيسي العلوم السياسية / فرعي الإقتصاد', 23),
('رئيسي العلوم السياسية / فرعي الادارة العامة', 23),
('فرعي العلوم السياسية', 23),
('رئيسي العلوم السياسية / فرعي دراسات المرأة', 23),
('رئيسي العلوم السياسية / فرعي الفلسفة', 23),
('فرعي علاقات دولية', 23),
('رئيسي العلوم السياسية / فرعي علاقات دولية', 23),
('العلاقات الدولية', 23),
('ماجستير القانون والاقتصاد', 23),
('ماجستير الحكومة والحكم المحلي', 23);


INSERT INTO majors (name, college)
VALUES
('التمريض', 24),
('ماجستير تمريض الأورام', 24),
('التغذية والحمية', 24),
('فرعي التغذية والحمية', 24),
('دكتور صيدلي', 24),
('ماجستير تكنولوجيا الصناعة الدوائية', 24),
('علاج النطق والسمع', 24),
('معهد معهد سميح دروزة للصناعات الدوائية', 24),
('ماجستير العلوم الطبية المخبرية', 24);

INSERT INTO majors (name, college)
VALUES
('التربية', 25),
('دبلوم التأهيل التربوي / مسار تعليم التخصص', 25),
('دبلوم التأهيل التربوي / المسار العام', 25),
('معلم المرحلة الأساسية العليا - تعليم الاجتماعيات', 25),
('معلم المرحلة الأساسية العليا - تعليم العلوم', 25),
('معلم المرحلة الأساسية العليا - تعليم الرياضيات', 25),
('معلم المرحلة الأساسية العليا - تعليم التكنولوجيا', 25),
('دبلوم التأهيل التربوي للمرحلة الأساسية العليا / مسار تعليم التخصص', 25),
('دبلوم التأهيل التربوي للمرحلة الثانوية / مسار تعليم التخصص', 25),
('دبلوم التأهيل التربوي للمرحلة الثانوية - تعليم اللغة العربية', 25),
('دبلوم التأهيل التربوي للمرحلة الثانوية - تعليم اللغة الفرنسية', 25),
('دبلوم التأهيل التربوي للمرحلة الثانوية - تعليم تكنولوجيا المعلومات', 25),
('دبلوم التأهيل التربوي للمرحلة الثانوية - تعليم الفيزياء', 25),
('دبلوم التأهيل التربوي للمرحلة الثانوية - تعليم الأحياء', 25),
('دبلوم التأهيل التربوي للمرحلة الثانوية - تعليم الإدارة والإقتصاد', 25),
('دبلوم التأهيل التربوي للمرحلة الثانوية - تعليم اللغة الإنجليزية', 25),
('دبلوم التأهيل التربوي للمرحلة الثانوية - تعليم الرياضيات', 25),
('دبلوم التأهيل التربوي للمرحلة الثانوية - تعليم الكيمياء', 25),
('دبلوم التأهيل التربوي للمرحلة الثانوية - تعليم الجغرافيا', 25),
('دبلوم التأهيل التربوي للمرحلة الثانوية - تعليم التاريخ', 25),
('دبلوم التأهيل التربوي للمرحلة الأساسية العليا - تعليم التكنولوجيا', 25),
('دبلوم التأهيل التربوي للمرحلة الأساسية العليا - تعليم العلوم', 25),
('دبلوم التأهيل التربوي للمرحلة الأساسية العليا - تعليم الاجتماعيات', 25),
('تعليم اللغة الإنجليزية كلغة أجنبية', 25),
('دبلوم التأهيل التربوي - تعليم اللغة الإنجليزية وآدابها', 25),
('دبلوم التأهيل التربوي - تعليم العلوم', 25),
('دبلوم التأهيل التربوي - تعليم اللغة العربية وآدابها', 25),
('دبلوم التأهيل التربوي - تعليم الرياضيات', 25),
('دبلوم التأهيل التربوي - تعليم الاجتماعيات', 25),
('التعليم الجامع والتربية الخاصة', 25),
('ماجستير التربية', 25),
('التربية الرياضية', 25),
('التعليم التعاوني', 25);


INSERT INTO majors (name, college)
VALUES
('الهندسة المعمارية', 26),
('هندسة التخطيط والتصميم الحضري', 26),
('الهندسة المدنية', 26),
('الهندسة البيئية', 26),
('ماجستير الهندسة المدنية', 26),
('الهندسة الميكانيكية', 26),
('هندسة الميكاترونيكس', 26),
('ماجستير الهندسة الميكانيكية', 26),
('علم الحاسوب', 26),
('فرعي علم الحاسوب', 26),
('دكتوراه علم الحاسوب', 26),
('التعليم التعاوني', 26),
('الهندسة الكهربائية', 26),
('هندسة أنظمة الحاسوب', 26),
('هندسة الحاسوب', 26),
('ماجستير هندسة الحاسوب', 26),
('ماجستير هندسة التخطيط العمراني وعمارة المشهد', 26),
('ماجستير الحوسبة', 26),
('ماجستير هندسة الإستدامة في الإنتاج', 26),
('ماجستير هندسة البرمجيات', 26),
('ماجستير الهندسة الكهربائية', 26),
('القيادة والمواطنة الفاعلة', 26);

INSERT INTO majors (name, college)
VALUES
('الموسيقى', 27),
('الفنون البصرية المعاصرة', 27),
('فرعي الموسيقى العربية', 27),
('التصميم', 27),
('الموسيقى', 27);

INSERT INTO majors (name, college)
VALUES
('دبلوم متوسط التأمين', 28),
('دبلوم متوسط الوساطة المالية', 28);