INSERT INTO universities
VALUES
(10, 'جامعة القدس');


--

INSERT INTO colleges (name, university)
VALUES
('كلية الآداب', 10),
('كلية الأعمال و الإقتصاد', 10),
('كلية الحقوق', 10),
('كلية الدعوة وأصول الدين', 10),
('كلية الصحة العامة', 10),
('كلية الصيدلة', 10),
('كلية العلوم التربوية', 10),
('كلية العلوم والتكنولوجيا', 10),
('كلية القرآن و الدراسات الإسلامية', 10),
('كلية المهن الصحية', 10),
('كلية الهندسة', 10),
('كلية طب الأسنان', 10),
('كلية هند الحسيني للبنات', 10),
('كلية الطب البشري', 10),
('كلية الدراسات الثنائية', 10);

INSERT INTO majors (name, college)
VALUES
('الاتصال الرقمي', 62),
('الماجستير في الدراسات الاسلامية المعاصرة', 62),
('الماجستير في علم الجريمة', 62),
('الفنون الجميلة', 62),
('التاريخ', 62),
('التربية الرياضية', 62),
('الجغرافيا', 62),
('العلوم السياسية', 62),
('اللغة الأنجليزية', 62),
('اللغة العربية', 62),
('علم الآثار', 62),
('الماجستير الدراسات المقدسية', 62),
('الماجستير في الإعلام الرقمي والاتصال', 62),
('الماجستير في الجغرافيا', 62),
('الماجستير في الخدمة الإجتماعية', 62),
('الماجستير في اللغة العربية', 62),

('إدارة الأعمال', 63),
('الإقتصاد', 63),
('التسويق', 63),
('العلوم التنموية', 63),
('العلوم المالية والمصرفية', 63),
('المحاسبة', 63),
('الماجستير في كلية الأعمال والإقتصاد', 63),


('الحقوق', 64),
('الماجستير في الدراسات القضائية', 64),
('الماجستير في القانون', 64),
('الماجستير في القانون الجنائي', 64),
('الماجستير في القانون الخاص', 64),
('الماجستير في القانون العام', 64),
('الماجستير في الملكية الفكرية', 64),


('الدعوة أصول الدين', 65),
('الماجستير في أصول الدين', 65),
('الماجستير في الفقه والتشريع', 65),

('التغذية', 66),
('الماجستير في التعزيز الصحي', 66),
('الماجستير في السياسات والإدارة الصحية', 66),
('الماجستير في الصحة النفسية', 66),
('الماجستير في الصحة النفسية المجتمعية- مسار العلاج النفسي', 66),
('الماجستير في الوقاية وضبط الأمراض', 66),
('الماجستير في صحة الأسرة', 66),
('الماجستير في صحة البيئة', 66),
('الماجستير في علم الأوبئة', 66),
('الماجستير في مسار الوبائيات', 66),


('الصيدلة', 67),
('الماجستير في العلوم الصيدلانية', 67),


('التربية الرياضية', 68),
('تعليم المرحلة الأساسية ورياض الاطفال', 68),
('علم النفس', 68),
('الدكتوراة في القيادة والادارة التربوية', 68),
('الماجستير في أساليب التدريس', 68),
('الماجستير في اساليب التعليم', 68),
('الماجستير في الإدارة التربوية', 68),
('الماجستير في الإرشاد النفسي', 68),
('الماجستير في الارشاد النفسي', 68),
('الماجستير في الارشاد النفسي مسار الارشاد الأسري', 68),
('الماجستير في التربية الخاصة', 68),
('الماجستير في التعليم في الطفولة المبكرة', 68),


('الرياضيات', 69),
('العلوم الحياتية', 69),
('الفيزياء', 69),
('الكيمياء', 69),
('الماجستير في ابتكارات علوم المياه', 69),
('الماجستير في التكنولوجيا التطبيقية والصناعية', 69),
('الماجستير في الطاقة المتجددة والاستدامة', 69),
('الماجستير في الفيزياء', 69),

('برنامج القرآن الكريم', 70),


('التخدير والإنعاش', 71), 
('التصوير الطبي', 71), 
('التمريض', 71), 
('العلاج الطبيعي', 71), 
('العلوم المخبرية', 71), 
('القبالة', 71), 
('الماجستير في التصوير الطبي', 71), 
('الماجستير في التمريض', 71), 
('الماجستير في العلاج الطبيعي', 71), 
('الماجستير في العلوم المخبرية', 71), 


('الهندسة الإلكترونية', 72),
('الهندسة الصناعية دراسات ثنائية', 72),
('الهندسة الكهربائية دراسات ثنائية', 72),
('الهندسة المعمارية', 72),
('هندسة الأغذية', 72),
('هندسة الإتصالات', 72),
('هندسة الحاسوب', 72),
('هندسة المواد', 72),
('الماجستير في الطاقة المتجددة والاستدامة', 72),
('الماجستير في هندسة الأعمال الزراعية الربحية', 72),
('الماجستير في هندسة الحاسوب و الإلكترونيات', 72),

('طب الاسنان', 73),

('التاريخ', 74),
('التربية الخاصة', 74),
('التربية الرياضية', 74),
('الخدمة الإجتماعية', 74),
('اللغة الأنجليزية', 74),
('اللغة العربية', 74),
('تعليم المراحل الأساسية ورياض الاطفال', 74),

('الطب البشري', 75),
('الماجستير في الطب البشري', 75),

('الأعمال الرقمية', 76),
('برنامج إدارة الأعمال', 76),
('برنامج تكنولوجيا المعلومات', 76),
('الهندســـة الصناعيـــة', 76),
('الهندسة الكهربائية', 76);