INSERT INTO universities
VALUES
(12, 'جامعة الزيتونة');

INSERT INTO colleges (name, university)
VALUES
('كلية الإدارة والأعمال', 12),
('كلية الهندسة والتكنولوجيا', 12),
('كلية العلوم الطبيعية والصحية', 12),
('كلية الزيتونة المتوسطة', 12);

INSERT INTO majors (name, college)
VALUES
('إدارة سلسلة الإمداد والنقل والتوريد', 85);
('التسويق الرقمي', 85),
('الأسواق والمنشآت المالية', 85),
('المحاسبة', 85),
('هندسة المشهد وفضاءات الطبيعة', 86),
('هندسة الروبوت والتحكم', 86),
('هندسة الطاقة المتجددة', 86),
('الإسعاف وعناية طوارئ', 87),
('المعلوماتية الصحية', 87),
('علم الأحياء الدقيقة الغذائي والصناعي', 87),
('أنظمة الحماية المتكاملة', 88),
('برمجة تطبيقات الموبايل', 88),
('دبلوم تكنولوجيا الأجهزة الطبية', 88),
('تكنولوجيا الدهانات والألوان', 88),
('دبلوم خدمات مكاتب التأمين', 88),
('دبلوم إدارة التسويق والمعارض التجارية', 88),
('دبلوم تكنولوجيا المصاعد والأدراج الكهربائية', 88),
('دبلوم تكنولوجيا الاتصالات اللاسلكية', 88);